Revit 2027 API
FileImportingEventArgs.Path Property
 Path of the source file which is about to be imported.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
public:
property String^ Path {
	String^ get ();
}
member Path : string with get
Property Value
String
See Also
Reference
FileImportingEventArgs Class
Autodesk.Revit.DB.Events Namespace